src/logs/api/test-api-get-current-week-statistics-20250731-142849.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/api/test-api-get-current-week-statistics.ts
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 816 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 1606 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 2179 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 2921 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 3775 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 4666 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 5494 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 6342 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 7223 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 7864 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s


  █ TOTAL RESULTS 

    checks_total.......................: 7874    785.199197/s
    checks_succeeded...................: 100.00% 7874 out of 7874
    checks_failed......................: 0.00%   0 out of 7874

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=10.95ms min=4.33ms med=9ms    max=92.55ms  p(90)=14.73ms p(95)=18ms   
      { expected_response:true }............................................: avg=10.95ms min=4.33ms med=9ms    max=92.55ms  p(90)=14.73ms p(95)=18ms   
    http_req_failed.........................................................: 0.00%  0 out of 7874
    http_reqs...............................................................: 7874   785.199197/s

    EXECUTION
    iteration_duration......................................................: avg=12.7ms  min=4.33ms med=9.99ms max=364.46ms p(90)=16.91ms p(95)=21.65ms
    iterations..............................................................: 7874   785.199197/s
    vus.....................................................................: 10     min=10        max=10
    vus_max.................................................................: 10     min=10        max=10

    NETWORK
    data_received...........................................................: 11 MB  1.1 MB/s
    data_sent...............................................................: 1.2 MB 117 kB/s



running (10.0s), 00/10 VUs, 7874 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s