src/logs/api/test-api-get-weekly-statistic-20250731-142838.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/api/test-api-get-weekly-statistic.ts
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 987 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 2011 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 2873 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 3856 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 4920 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 5908 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 6847 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 8024 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 9132 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 9801 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s


  █ TOTAL RESULTS 

    checks_total.......................: 9815    980.198346/s
    checks_succeeded...................: 100.00% 9815 out of 9815
    checks_failed......................: 0.00%   0 out of 9815

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=7.79ms  min=2ms    med=5.64ms max=106.71ms p(90)=10.99ms p(95)=15.59ms
      { expected_response:true }............................................: avg=7.79ms  min=2ms    med=5.64ms max=106.71ms p(90)=10.99ms p(95)=15.59ms
    http_req_failed.........................................................: 0.00%  0 out of 9815
    http_reqs...............................................................: 9815   980.198346/s

    EXECUTION
    iteration_duration......................................................: avg=10.17ms min=2.99ms med=7ms    max=156.62ms p(90)=15.21ms p(95)=23.26ms
    iterations..............................................................: 9815   980.198346/s
    vus.....................................................................: 10     min=10        max=10
    vus_max.................................................................: 10     min=10        max=10

    NETWORK
    data_received...........................................................: 13 MB  1.3 MB/s
    data_sent...............................................................: 1.5 MB 153 kB/s



running (10.0s), 00/10 VUs, 9815 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s