src/logs/api/test-api-get-weekly-statistics-by-date-20250731-142901.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/api/test-api-get-weekly-statistics-by-date.ts
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 676 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 1524 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 2372 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 3234 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 4089 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 4857 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 5443 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 6323 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 7250 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 8494 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s


  █ TOTAL RESULTS 

    checks_total.......................: 8514   850.905496/s
    checks_succeeded...................: 73.31% 6242 out of 8514
    checks_failed......................: 26.68% 2272 out of 8514

    ✗ status is 200
      ↳  73% — ✓ 6242 / ✗ 2272

    HTTP
    http_req_duration.......................................................: avg=10.22ms min=2.78ms med=8.72ms max=80.9ms   p(90)=14.58ms p(95)=18.18ms
      { expected_response:true }............................................: avg=11.13ms min=2.99ms med=9.25ms max=80.9ms   p(90)=15.24ms p(95)=20.05ms
    http_req_failed.........................................................: 26.68% 2272 out of 8514
    http_reqs...............................................................: 8514   850.905496/s

    EXECUTION
    iteration_duration......................................................: avg=11.72ms min=2.99ms med=9.52ms max=146.27ms p(90)=16.34ms p(95)=21.35ms
    iterations..............................................................: 8514   850.905496/s
    vus.....................................................................: 10     min=10           max=10
    vus_max.................................................................: 10     min=10           max=10

    NETWORK
    data_received...........................................................: 9.4 MB 935 kB/s
    data_sent...............................................................: 1.5 MB 152 kB/s



running (10.0s), 00/10 VUs, 8514 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s